binutils
btop
btrfs-progs
cmake
dosfstools
easyeffects
efibootmgr # EFI boot
ethtool
gdb
grub
gst-plugin-pipewire
hdparm
htop
jq
lib32-mesa
lib32-pipewire
lib32-pipewire-jack
lib32-pipewire-v4l2
libva-mesa-driver
libva-utils
libvdpau-va-gl
linux-headers
mesa
mesa-vdpau
ncdu
noto-fonts-emoji
noise-suppression-for-voice
os-prober
packagekit-qt5
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
pipewire-v4l2
python-pip
python-pytesseract
qpwgraph
stow
usbutils
vulkan-tools
wireplumber
xdg-user-dirs
xorg-server
xorg-xkill
xorg-xinit
xorg-xinput
xterm
zsh
--END OF MINIMAL INSTALL--
alsa-plugins # audio plugins
alsa-utils # audio utils
autoconf # build
automake # build
awesome-terminal-fonts
barrier
base
bash-completion
bind
binutils
bison
bluez
bluez-libs
bluez-utils
bridge-utils
cmatrix
cronie
cups
cups-pdf
dialog
discord
dmidecode
dnsmasq
dosfstools
dtc
edk2-ovmf # UEFI Support for Virt-Manager
egl-wayland
exfatprogs
filezilla
firefox
flameshot
flex # recognize lexical patterns in text
freerdp
fuse2
fuse3
fuseiso
gamemode
gcc
gimp # Photo editing
git
gptfdisk
gradle
grub-customizer
gst-libav
gst-plugins-good
gst-plugins-ugly
gutenprint
handbrake
haveged
hunspell
hunspell-en_us
hunspell-de
imagemagick
inetutils
inkscape
#iptables-nft
jdk-openjdk # Java 17
libappindicator-gtk3
libdvdcss
libindicator-gtk2
libindicator-gtk3
libnewt
libreoffice-still
libreoffice-still-de
libtool
libvncserver
linux
linux-firmware
linux-headers
linux-lts
linux-lts-headers
lsof
lutris
lzop
m4
make
man-db
man-pages
mpv
nano
neofetch
neovim
net-tools
networkmanager
networkmanager-openconnect
networkmanager-openvpn
networkmanager-vpnc
nfs-utils
nmap
npm
ntfs-3g
obs-studio
openbsd-netcat
openssh
p7zip
pacman-contrib
partitionmanager
patch
pavucontrol
php-cgi
php
php-apache
php-cgi
php-gd
picom
pkgconf
powerline-fonts
powertop
python-notify2
python-psutil
python-pyqt5
qemu-full
remmina
rsync
screen
scrot
shellcheck
signal-desktop
simple-scan
#snapper
solaar
speedtest-cli
steam
swtpm
telegram-desktop
terminus-font
tesseract
tesseract-data-deu
tesseract-data-eng
texinfo
texmaker
thunderbird
thunderbird-i18n-de
thunderbird-i18n-en-us
timeshift
tldr
traceroute
tree
ttf-droid
ttf-hack
ttf-roboto
ufw
unrar
unzip
usbutils
vde2
vi
vim
vim-gitgutter
virt-manager
virt-viewer
v4l2loopback-dkms
wget
which
wine
wine-gecko
wine-mono
winetricks
wireguard-tools
wireless_tools
wireshark-qt
xdg-desktop-portal
xdotool
xfsprogs
xsel
zip
zsh-syntax-highlighting
zsh-autosuggestions
