mesa # Essential Xorg First
xorg
xorg-server
xorg-apps
xorg-drivers
xorg-xkill
xorg-xinit
xterm
plasma-desktop # KDE Load second
alsa-plugins # audio plugins
alsa-utils # audio utils
ark # compression
audiocd-kio # CD/DVD Audio
autoconf # build
automake # build
barrier
base
bash-completion
bind
binutils
bison
bluedevil
bluez
bluez-libs
bluez-utils
breeze
breeze-gtk
bridge-utils
btrfs-progs
celluloid # video players
cmatrix
code # Visual Studio code
cronie
cups
cups-pdf
dialog
discord
dolphin
dolphin-plugins
dosfstools
dtc
efibootmgr # EFI boot
egl-wayland
evolution
exfat-utils
extra-cmake-modules
filelight
firefox
flameshot
flex # recognize lexical patterns in text
fuse2
fuse3
fuseiso
gamemode
gcc
gimp # Photo editing
git
gptfdisk
gradle
grub
grub-customizer
gst-libav
gst-plugins-good
gst-plugins-ugly
gutenprint
gwenview
haveged
htop
hunspell
hunspell-en_us
hunspell-de
#iptables-nft
jdk-openjdk # Java 17
kate
kcalc
kcharselect
kcodecs
kcoreaddons
kcrash
kcron
kde-gtk-config
kdeconnect
konsole
kdenetwork-filesharing
kdenlive
kdeplasma-addons
kdialog
keychain
kfind
kgamma5
kgpg
khotkeys
kinfocenter
kmenuedit
kompare
konsole
krdc
kscreen
ksystemlog
ksysguard
ktorrent
kwallet
kwallet-pam
layer-shell-qt
libappindicator-gtk3
libdvdcss
libindicator-gtk2
libindicator-gtk3
libnewt
libreoffice-still
libreoffice-still-de
libtool
libvncserver
linux
linux-firmware
linux-headers
linux-lts
linux-lts-headers
lsof
lutris
lzop
m4
make
man-db
man-pages
milou # alternative to KRunner
nano
ncdu
neofetch
neovim
net-tools
networkmanager
networkmanager-openconnect
networkmanager-openvpn
networkmanager-vpnc
nfs-utils
nmap
npm
ntfs-3g
ntp
obs-studio
okular
openbsd-netcat
openssh
os-prober
oxygen
p7zip
pacman-contrib
partitionmanager
patch
pavucontrol
php-cgi
php7
php7-apache
php7-cgi
php7-gd
picom
pkgconf
plasma-browser-integration
plasma-disks
plasma-firewall
plasma-nm
plasma-pa
plasma-thunderbolt
plasma-vault
powerdevil
powerline-fonts
powertop
print-manager
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
python-notify2
python-psutil
python-pyqt5
python-pip
qemu
qemu-arch-extra
remmina
rsync
screen
scrot
sddm
sddm-kcm
shellcheck
simple-scan
simplescreenrecorder
#snapper
#spectacle
speedtest-cli
steam
stow
sudo
swtpm
systemsettings
terminus-font
tesseract
tesseract-data-deu
tesseract-data-eng
texinfo
thunderbird
thunderbird-i18n-de
thunderbird-i18n-en-us
traceroute
tree
ufw
unrar
unzip
usbutils
vi
vim
virt-manager
virt-viewer
vlc
wget
which
wine
wine-gecko
wine-mono
winetricks
wireguard-tools
wireless_tools
wireshark-qt
xdg-desktop-portal-kde
xdg-user-dirs
xdotool
xfsprogs
xsel
zeroconf-ioslave
zip
zsh
zsh-syntax-highlighting
zsh-autosuggestions